Repository: amorphousphage/dartsguesser
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: de, es, fr, it, nl

source: Enter a security question of your choice and your answer. In case you forget the password, you will be prompted with the question and need to answer exactly as you written in the answer field.
de: Geben Sie eine Sicherheitsfrage Ihrer Wahl und die Antwort ein. Falls Sie das Passwort vergessen, wird Ihnen diese Frage gestellt und müssen genau so antworten, wie Sie es im Antwortfeld eingegeben haben.
es: Ingresa una pregunta de seguridad de tu elección y tu respuesta.
fr: Entrez une question de sécurité de votre choix et votre réponse.
it: Inserisci una domanda di sicurezza a tua scelta e la tua risposta.
nl: Voer een beveiligingsvraag naar keuze en uw antwoord in.

source: Reset Password
de: Passwort zurücksetzen
es: Restablecer contraseña
fr: Réinitialiser le mot de passe
it: Reimposta password
nl: Wachtwoord opnieuw instellen

source: Security Question:
de: Sicherheitsfrage:
es: Pregunta de seguridad:
fr: Question de sécurité :
it: Domanda di sicurezza:
nl: Beveiligingsvraag:

source: Answer:
de: Antwort:
es: Respuesta:
fr: Réponse :
it: Risposta:
nl: Antwoord:

source: New Password:
de: Neues Passwort:
es: Nueva Contraseña:
fr: Nouveau mot de passe :
it: Nuova password:
nl: Nieuw wachtwoord:

source: For guessing the correct winner of any match.
fr: Pour deviner le bon vainqueur de n’importe quel match.
