Repository: amorphousphage/dartsguesser
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: de, es, fr, it, nl

source: Username is already taken. Please choose a different one.
de: Benutzername ist bereits vergeben. Bitte wählen Sie einen anderen.
es: El nombre de usuario ya está en uso.
fr: Le nom d'utilisateur est déjà pris.
it: Il nome utente è già occupato.
nl: Gebruikersnaam is al in gebruik.

source: Registration successful! Please log in.
de: Registrierung erfolgreich! Bitte loggen Sie sich ein.
es: ¡Registro exitoso!
fr: Inscription réussie !
it: Registrazione riuscita!
nl: Registratie succesvol!

source: Login successful!
de: Erfolgreich eingeloggt!
es: ¡Inicie sesión exitosamente!
fr: Connexion réussie !
it: Accesso riuscito!
nl: Inloggen succesvol!

source: Invalid credentials. Please try again.
de: Ungültige Anmeldedaten. Bitte versuchen Sie es erneut.
es: Credenciales no válidas.
fr: Identifiants invalides.
it: Credenziali non valide.
nl: Ongeldige inloggegevens.

source: You have been logged out.
de: Sie wurden ausgeloggt.
es: Has cerrado tu sesión.
fr: Vous avez été déconnecté.
it: Sei stato disconnesso.
nl: Je bent uitgelogd.

source: Please enter the username and then click the forgot password link.
de: Bitte geben Sie den Benutzernamen ein und klicken Sie dann auf den Link 'Passwort vergessen'.
es: Ingrese el nombre de usuario y luego haga clic en el enlace ¿Olvidé mi contraseña?
fr: Veuillez saisir le nom d'utilisateur, puis cliquez sur le lien Mot de passe oublié.
it: Inserisci il nome utente, quindi fai clic sul collegamento Password dimenticata.
nl: Voer de gebruikersnaam in en klik vervolgens op de link Wachtwoord vergeten.

source: Username not found.
de: Benutzername nicht gefunden.
es: Nombre de usuario no encontrado.
fr: Nom d'utilisateur introuvable.
it: Nome utente non trovato.
nl: Gebruikersnaam niet gevonden.

source: Password successfully updated.
de: Passwort erfolgreich aktualisiert.
es: Contraseña actualizada exitosamente.
fr: Mot de passe mis à jour avec succès.
it: Password aggiornata con successo.
nl: Wachtwoord succesvol bijgewerkt.

source: Incorrect answer to security question.
de: Falsche Antwort auf die Sicherheitsfrage.
es: Respuesta incorrecta a pregunta de seguridad.
fr: Réponse incorrecte à la question de sécurité.
it: Risposta errata alla domanda di sicurezza.
nl: Onjuist antwoord op beveiligingsvraag.

source: Please log in to access the dashboard.
de: Bitte loggen Sie sich ein, um auf das Dashboard zuzugreifen.
es: Inicie sesión para acceder al panel.
fr: Veuillez vous connecter pour accéder au tableau de bord.
it: Effettua il login per accedere alla dashboard.
nl: Log in om toegang te krijgen tot het dashboard.

source: Time of the Match: {} (GMT)
de: Spielzeit: {} (GMT)
es: Hora del partido: {} (GMT)
fr: Heure du match : {} (GMT)
it: Orario della partita: {} (GMT)
nl: Tijd van de wedstrijd: {} (GMT)

source: (Match not finished yet)
es: (Partido aún no terminado)
it: (Partita non ancora terminata)

source: No guess
de: Kein Tipp
es: Sin adivinar
fr: Pas devinette
it: Nessuna ipotesi
nl: Geen gok

source: Tournament Winner (+ 20 Points)
de: Turniersieger (+ 20 Punkte)
es: Ganador del torneo (20 puntos)
fr: Vainqueur du tournoi (20 points)
it: Vincitore del torneo (20 punti)
nl: Toernooiwinnaar (20 punten)

source: Player with most 180s thrown (+ 10 Points)
de: Spieler mit den meisten 180ern (+ 10 Punkte)
es: Jugador con más lanzamientos de 180 (10 puntos)
fr: Joueur avec le plus de 180 lancés (10 points)
it: Giocatore con più 180 lanciati (10 punti)
nl: Speler met de meeste 180's gegooid (10 punten)

source: Number of 180s thrown total (+ max. 40 Points (-5 Points for every 10 180s off))
de: Anzahl der insgesamt geworfenen 180er (+ max. 40 Punkte (-5 Punkte für je 10 180er Differenz zum Resultat))
es: Número total de 180 lanzados (máximo 40 puntos (-5 puntos por cada 10 180 de descuento))
fr: Nombre total de 180 lancés (max. 40 points (-5 points pour chaque 10 180 de réduction))
it: Numero di 180 lanciati in totale (max. 40 punti (-5 punti per ogni 10 180 disattivati))
nl: Totaal aantal 180s gegooid (max. 40 punten (-5 punten voor elke 10 180s uit))

source: Number of 9-darters thrown (+ 20 Points)
de: Anzahl der 9-Darter (+ 20 Punkte)
es: Número de 9 dardos lanzados (20 puntos)
fr: Nombre de 9 fléchettes lancées (20 points)
it: Numero di 9 dardi lanciati (20 punti)
nl: Aantal 9-darters gegooid (20 punten)

source: Player with the highest checkout (+ 20 Points)
de: Spieler mit dem höchsten Checkout (+ 20 Punkte)
es: Jugador con el checkout más alto (20 Puntos)
fr: Joueur avec le paiement le plus élevé (20 points)
it: Giocatore con il checkout più alto (20 punti)
nl: Speler met de hoogste kassa (20 punten)

source: (+ 0 points)
de: (+ 0 Punkte)
es: ( 0 puntos)
fr: ( 0 point)
it: ( 0 punti)
nl: ( 0 punten)

source: ({} points off from {} (+{} points))
de: ({} Punkte abweichend von {} (+{} Punkte))
es: ({} puntos menos que {} ( {} puntos))
fr: ({} points de moins que {} ( {} points))
it: ({} punti in meno rispetto a {} ( {} punti))
nl: ({} punten verwijderd van {} ( {} punten))

source: odds
de: Quote
es: cuota
it: quota
nl: Notering

source: Guess missed
de: Tipp verpasst
es: Supongo que se perdió
fr: Devinez manqué
it: Immagino che mi sia sfuggito
nl: Denk gemist

source: Are you sure you want to leave this group?
de: Sind Sie sicher, dass Sie diese Gruppe verlassen möchten?
es: ¿Estás seguro de que quieres abandonar este grupo?
fr: Êtes-vous sûr de vouloir quitter ce groupe ?
it: Sei sicuro di voler lasciare questo gruppo?
nl: Weet je zeker dat je deze groep wilt verlaten?

source: Group created successfully!
de: Gruppe erfolgreich erstellt!
es: ¡Grupo creado exitosamente!
fr: Groupe créé avec succès !
it: Gruppo creato con successo!
nl: Groep succesvol aangemaakt!

source: You have successfully joined the group!
de: Sie sind der Gruppe erfolgreich beigetreten!
es: ¡Te has unido exitosamente al grupo!
fr: Vous avez rejoint le groupe avec succès !
it: Ti sei unito al gruppo con successo!
nl: Je bent succesvol lid geworden van de groep!

source: Group not found. Please check the group ID and try again.
de: Gruppe nicht gefunden. Bitte überprüfen Sie die Gruppen-ID und versuchen Sie es erneut.
es: Grupo no encontrado.
fr: Groupe introuvable.
it: Gruppo non trovato.
nl: Groep niet gevonden.

source: Category
de: Kategorie
es: Categoría
fr: Catégorie
it: Categoria
nl: Categorie

source: Guess
de: Tipp
es: Adivina
fr: Devinez
it: Indovina
nl: Raad eens

source: Place
de: Platz
es: Lugar
fr: Lieu
it: Luogo
nl: Plaats

source: Username
de: Benutzername
es: nombre de usuario
fr: Nom d'utilisateur
it: Nome utente
nl: Gebruikersnaam

source: Points
de: Punkte
es: Puntos
it: Punti
nl: Punten

source: Guesses saved successfully!
de: Tipps erfolgreich gespeichert!
es: ¡Las conjeturas se guardaron correctamente!
fr: Devinettes enregistrées avec succès !
it: Ipotesi salvate con successo!
nl: Gissingen succesvol opgeslagen!

source: Overall Tournament Guesses saved successfully!
de: Turnier-Tipps erfolgreich gespeichert!
es: ¡Las conjeturas generales del torneo se guardaron correctamente!
fr: Les suppositions globales du tournoi ont été enregistrées avec succès !
it: Ipotesi complessive del torneo salvate con successo!
nl: Totale toernooischattingen succesvol opgeslagen!

source: Back
de: Zurück
es: Volver
fr: Retour
it: Indietro
nl: Terug

source: Your current points:
de: Ihr derzeitiger Punktestand:
es: Tus puntos actuales:
fr: Vos points actuels :
it: I tuoi punti attuali:
nl: Je huidige punten:

source: Create a group
de: Gruppe erstellen
es: crear un grupo
fr: Créer un groupe
it: Crea un gruppo
nl: Maak een groep

source: Group Name
de: Gruppenname
es: Nombre del grupo
fr: Nom du groupe
it: Nome gruppo
nl: Groepsnaam

source: Welcome
de: Willkommen
es: ¡Bienvenido
fr: Bienvenue
it: Benvenuto
nl: Welkom

source: to your Darts WC 2025 dashboard!
de: zu Ihrem Darts-WM-2025-Dashboard!
es: a tu tablero de Campeonato del mundo de dardos 2025!
fr: à votre tableau de bord Darts Championnat du monde 2025 !
it: al cruscotto del tuo Darts Campionato mondiale 2025!
nl: naar je Darts WK 2025-dashboard!

source: Place your guesses in the "My Guesses" page by selecting the Overall Tournament Guesses or any round first. Don't forget to save your guesses!
de: Geben Sie Ihre Tipps auf der Seite "Meine Tipps" ab, indem Sie zuerst die Turnier-Tipps oder eine Runde auswählen. Vergessen Sie nicht, Ihre Tipps zu speichern!
es: Coloca tus conjeturas en la página "Mis conjeturas" seleccionando primero las Conjeturas generales del torneo o cualquier ronda.
fr: Placez vos suppositions dans la page « Mes suppositions » en sélectionnant d'abord les suppositions globales du tournoi ou n'importe quel tour.
it: Inserisci le tue ipotesi nella pagina "Le mie ipotesi" selezionando prima le ipotesi complessive del torneo o qualsiasi round.
nl: Plaats uw gissingen op de pagina "Mijn Gissingen" door eerst de Totaal Toernooi Gissingen of een willekeurige ronde te selecteren.

source: Create and join some groups with friends in the "My Groups" page. There you can also see how you perform in comparison to your friends!
de: Erstellen und treten Sie Gruppen mit Freunden auf der Seite "Meine Gruppen" bei. Dort können Sie auch sehen, wie Sie im Vergleich zu Ihren Freunden abschneiden!
es: Crea y únete a algunos grupos con amigos en la página "Mis grupos".
fr: Créez et rejoignez des groupes avec des amis dans la page "Mes groupes".
it: Crea e unisciti ad alcuni gruppi con gli amici nella pagina "I miei gruppi".
nl: Maak een aantal groepen met vrienden en word er lid van op de pagina "Mijn groepen".

source: Learn how points are awarded
de: Erfahren Sie, wie DartsGuesser funktioniert
es: Aprende cómo se otorgan los puntos
fr: Découvrez comment les points sont attribués
it: Scopri come vengono assegnati i punti
nl: Ontdek hoe punten worden toegekend

source: My Guesses
de: Meine Tipps
es: Mis conjeturas
fr: Mes suppositions
it: Le mie ipotesi
nl: Mijn gissingen

source: My Groups
de: Meine Gruppen
es: Mis grupos
fr: Mes groupes
it: I miei gruppi
nl: Mijn groepen

source: Forgot Password
de: Passwort vergessen
es: Olvidé mi contraseña
fr: Mot de passe oublié
it: Password dimenticata
nl: Wachtwoord vergeten

source: Enter your username:
de: Geben Sie Ihren Benutzernamen ein:
es: Ingrese su nombre de usuario:
fr: Entrez votre nom d'utilisateur :
it: Inserisci il tuo nome utente:
nl: Voer uw gebruikersnaam in:

source: Submit
de: Absenden
es: Enviar
fr: Soumettre
it: Invia
nl: Verzenden

source: Group:
de: Gruppe:
es: Grupo:
fr: Groupe :
it: Gruppo:
nl: Groep:

source: Guesses for the group
de: Tipps für die Gruppe
es: Adivinaciones para el grupo
fr: Devinettes pour le groupe
it: Ipotesi per il gruppo
nl: Gissingen voor de groep

source: Join code for this group:
de: Beitrittscode für diese Gruppe:
es: Código de unión para este grupo:
fr: Code de connexion pour ce groupe :
it: Codice di iscrizione per questo gruppo:
nl: Deelnamecode voor deze groep:

source: Please send this code to a friend to invite them to the group.
de: Bitte senden Sie diesen Code an einen Freund, um ihn zur Gruppe einzuladen.
es: Envía este código a un amigo para invitarlo al grupo.
fr: Veuillez envoyer ce code à un ami pour l'inviter dans le groupe.
it: Per favore invia questo codice a un amico per invitarlo nel gruppo.
nl: Stuur deze code naar een vriend om hem uit te nodigen voor de groep.

source: Show the group's Leaderboard
de: Zeige das Gruppen-Leaderboard
es: Mostrar la tabla de clasificación del grupo.
fr: Afficher le classement du groupe
it: Mostra la classifica del gruppo
nl: Toon het klassement van de groep

source: Overall Tournament Guesses
de: Turnier-Tipps
es: Conjeturas generales del torneo
fr: Devinettes globales du tournoi
it: Ipotesi complessive del torneo
nl: Algemene toernooischattingen

source: Round 1
de: Runde 1
es: Ronda 1
fr: 1er tour
it: Giro 1
nl: Ronde 1

source: Round 2
de: Runde 2
es: Ronda 2
fr: 2e tour
it: Giro 2
nl: Ronde 2

source: Round 3
de: Runde 3
es: Ronda 3
fr: 3e tour
it: Giro 3
nl: Ronde 3

source: Final 16
de: Finale 16
fr: 16 finales
it: Finali 16
nl: Laatste 16

source: Quarter Final
de: Viertelfinale
es: Cuartos de final
fr: Quart de finale
it: Quarti di finale
nl: Kwartfinale

source: Semi Final
de: Halbfinale
fr: Demi-finale
it: Semifinale
nl: Halve Finale

source: Final
de: Finale
fr: Finale
it: Finale
nl: Finale

source: Welcome to DartsGuesser
de: Willkommen bei DartsGuesser
es: Bienvenido a DardosGuesser
fr: Bienvenue sur DartsGuesser
it: Benvenuti in DartsGuesser
nl: Welkom bij DartsGuesser

source: The place where you can submit a guess for every game and explore overall tournament statistics for the 2025 PDC Darts World Championship.
de: Der Ort, an dem Sie für jedes Spiel einen Tipp abgeben und die Gesamtstatistiken für die PDC Darts-Weltmeisterschaft 2025 erkunden können.
es: El lugar donde puedes enviar una suposición para cada juego y explorar las estadísticas generales del torneo para el Campeonato Mundial de Dardos PDC 2025.
fr: L'endroit où vous pouvez soumettre une supposition pour chaque match et explorer les statistiques globales du tournoi pour le Championnat du monde de fléchettes PDC 2025.
it: Il luogo in cui puoi inviare un'ipotesi per ogni gioco ed esplorare le statistiche generali del torneo per il Campionato mondiale di freccette PDC 2025.
nl: De plek waar je voor elke game een gok kunt doen en de algemene toernooistatistieken voor het PDC Darts Wereldkampioenschap 2025 kunt bekijken.

source: Guess on your own or create and join a group with friends for a friendly competition to see who is the best guesser for this year's Darts World Championship.
de: Tipp für sich selbst ab oder erstellen und treten Sie einer Gruppe mit Freunden bei, um in einem freundlichen Wettbewerb herauszufinden, wer der beste Tippgeber der diesjährigen Darts-Weltmeisterschaft ist.
es: Adivina por tu cuenta o crea y únete a un grupo con amigos para una competencia amistosa para ver quién es el mejor adivino para el Campeonato Mundial de Dardos de este año.
fr: Devinez par vous-même ou créez et rejoignez un groupe avec des amis pour une compétition amicale afin de voir qui sera le meilleur devineur pour le Championnat du monde de fléchettes de cette année.
it: Indovina da solo o crea e unisciti a un gruppo con gli amici per una competizione amichevole per vedere chi è il miglior indovinatore per il Campionato mondiale di freccette di quest'anno.
nl: Raad het zelf of creëer en sluit je aan bij een groep met vrienden voor een vriendschappelijke wedstrijd om te zien wie de beste gokker is voor het Darts Wereldkampioenschap van dit jaar.

source: Learn how it works
de: Erfahren Sie, wie es funktioniert
es: Aprende cómo funciona
fr: Découvrez comment cela fonctionne
it: Scopri come funziona
nl: Leer hoe het werkt

source: Register
de: Registrieren
es: Registrarse
fr: S'inscrire
it: Registra
nl: Registreren

source: Login
de: Einloggen
es: Iniciar sesión
fr: Connexion
it: Accedi
nl: Inloggen

source: How It Works
de: Wie DartsGuesser funktioniert
es: Cómo funciona
fr: Comment ça marche
it: Come funziona
nl: Hoe het werkt

source: This is how points are awarded in DartsGuesser:
de: So werden die Punkte für Dartsguesser verteilt:
es: Así se otorgan los puntos en DartsGuesser:
fr: Voici comment les points sont attribués dans DartsGuesser :
it: Ecco come vengono assegnati i punti in DartsGuesser:
nl: Dit is hoe punten worden toegekend in DartsGuesser:

source: The odds of a player
de: Die Quote eines Spielers
es: La cuota de un jugador
it: La quota di un giocatore
nl: De notering van een speler

source: For guessing the correct winner of any match you will be awarded the betting quote (from oddsportal.com) for this player.
de: Für das richtige Tippen des Gewinners eines Spiels erhalten Sie die Wettquote (von oddsportal.com) für diesen Spieler.
es: Por adivinar el ganador correcto de cualquier partido, recibirás la cuota (de oddsportal.com) para este jugador.
it: Indovinando il vincitore corretto di una partita, ti verrà assegnata la quota (da oddsportal.com) per questo giocatore.
nl: Als je de juiste winnaar van een wedstrijd raadt, ontvang je de notering (van oddsportal.com) voor deze speler.

source: 20 Points
de: 20 Punkte
es: 20 Puntos
it: 20 punti
nl: 20 punten

source: For predicting the correct World Champion.
de: Für das Vorhersagen des Weltmeisters.
es: Por predecir el Campeón del Mundo correcto.
fr: Pour avoir prédit le bon champion du monde.
it: Per aver pronosticato il Campione del Mondo corretto.
nl: Voor het voorspellen van de juiste wereldkampioen.

source: 10 Points
de: 10 Punkte
es: 10 puntos
it: 10 punti
nl: 10 punten

source: For correctly guessing the player with the most 180s.
de: Für das Vorhersagen des Spielers mit den meisten 180ern.
es: Por adivinar correctamente el jugador con más 180.
fr: Pour deviner correctement le joueur avec le plus de 180.
it: Per aver indovinato correttamente il giocatore con il maggior numero di 180.
nl: Voor het correct raden van de speler met de meeste 180's.

source: Up to 40 Points
de: Bis zu 40 Punkte
es: Hasta 40 Puntos
fr: jusqu'à 40 points
it: Fino a 40 punti
nl: Maximaal 40 punten

source: For guessing the number of thrown 180s throughout the tournament. For every 10 180s you are off, you will lose 5 points from the maximum of 40. No negative points are awarded.
de: Für das Vorhersagen der im Turnier geworfenen 180er. Für jede 10 180er, die der Tipp vom Resultat abweicht, werden 5 Punkte von den 40 Punkten abgezogen. Es gibt keine Negativpunkte.
es: Por adivinar el número de 180 lanzados a lo largo del torneo.
fr: Pour avoir deviné le nombre de 180 lancés tout au long du tournoi.
it: Per aver indovinato il numero di 180 lanciati durante il torneo.
nl: Voor het raden van het aantal gegooide 180's tijdens het toernooi.

source: For guessing the number of 9-darters throughout the tournament.
de: Für das Vorhersagen der Anzahl 9-darter im Turnier.
es: Por adivinar el número de 9 dardos a lo largo del torneo.
fr: Pour avoir deviné le nombre de 9 fléchettes tout au long du tournoi.
it: Per aver indovinato il numero di 9 giocatori durante il torneo.
nl: Voor het raden van het aantal 9-darters tijdens het toernooi.

source: For correctly guessing the player with the highest checkouts throughout the tournament. If multiple players score the same highest checkout (which does not have to be 170), the player with more counts of this checkout wins. If they tie in the counts, the next highest checkout is considered.
de: Für das Vorhersagen des Spielers mit dem höchsten Checkout. Falls mehrere Spieler den gleichen höchsten Checkout werfen (muss nicht 170 sein), gewinnt der Spieler mit der höheren Anzahl dieses Checkouts. Bei Gleichstand wird das nächst höhere Checkout herangezogen
es: Por adivinar correctamente el jugador con mayores checkouts a lo largo del torneo.
fr: Pour avoir deviné correctement le joueur ayant obtenu le plus grand nombre de caisses tout au long du tournoi.
it: Per aver indovinato correttamente il giocatore con le vincite più alte durante il torneo.
nl: Voor het correct raden van de speler met de hoogste kassa's tijdens het toernooi.

source: Remember to place your guesses no later than 1 hour before the scheduled start time of a match (London time) and provide your overall tournament guesses before 6 pm (London Time) on the day of the first match! Game On!
de: Bitte denken Sie daran, ihre Tipps nicht später als eine Stunde vor Matchbeginn (Londoner Zeit) abzugeben und tätigen sie Ihre Turnier-Tipps vor 18 Uhr (Londoner Zeit) des ersten Spieltages.
es: Recuerde realizar sus conjeturas a más tardar 1 hora antes de la hora de inicio programada de un partido (hora de Londres) y proporcionar sus conjeturas generales del torneo antes de las 6 p. m. (hora de Londres) del día del primer partido.
fr: N'oubliez pas de placer vos suppositions au plus tard 1 heure avant l'heure prévue du début d'un match (heure de Londres) et de fournir vos suppositions globales du tournoi avant 18 h 00 (heure de Londres) le jour du premier match !
it: Ricordati di inserire le tue ipotesi non più tardi di 1 ora prima dell'orario di inizio previsto per una partita (ora di Londra) e di fornire le tue ipotesi complessive del torneo prima delle 18:00 (ora di Londra) del giorno della prima partita!
nl: Vergeet niet om je gissingen uiterlijk 1 uur vóór de geplande starttijd van een wedstrijd (Londense tijd) te plaatsen en je totale toernooischattingen door te geven vóór 18.00 uur (Londense tijd) op de dag van de eerste wedstrijd!

source: Join a group
de: Einer Gruppe beitreten
es: Únete a un grupo
fr: Rejoindre un groupe
it: Unisciti a un gruppo
nl: Word lid van een groep

source: Join an Existing Group
de: Einer Gruppe beitreten
es: Únase a un grupo existente
fr: Rejoindre un groupe existant
it: Unisciti a un gruppo esistente
nl: Word lid van een bestaande groep

source: Group Identifier (8 characters)
de: Gruppen ID (8 Zeichen)
es: Identificador de grupo (8 caracteres)
fr: Identifiant du groupe (8 caractères)
it: Identificativo gruppo (8 caratteri)
nl: Groepsidentificatie (8 tekens)

source: Join Group
de: Gruppe beitreten
es: Unirse al grupo
fr: Rejoindre le groupe
it: Unisciti al gruppo
nl: Word lid van groep

source: Forgot password?
de: Passwort vergessen?
es: ¿Olvidaste tu contraseña?
fr: Mot de passe oublié ?
it: Password dimenticata?
nl: Wachtwoord vergeten?

source: Create Group
de: Gruppe erstellen
es: Crear grupo
fr: Créer un groupe
it: Crea gruppo
nl: Groep maken

source: Actions
de: Aktionen
es: Acciones
it: Azioni
nl: Acties

source: Leave group
de: Gruppe verlassen
es: abandonar grupo
fr: Quitter le groupe
it: Lascia il gruppo
nl: Groep verlaten

source: Make your tournament guesses
de: Geben Sie Ihre Turnier-Tipps ab
es: Haz tus conjeturas en el torneo
fr: Faites vos suppositions sur le tournoi
it: Fai delle ipotesi sul torneo
nl: Maak je toernooischattingen

source: Please make sure you save your guesses each time before you view another round (or the overall tournament guesses).
de: Stellen Sie bitte sicher, dass Sie Ihre Tipps jedes Mal speichern, bevor Sie eine weitere Runde (oder die Turnier-Tipps) anzeigen.
es: Asegúrate de guardar tus conjeturas cada vez antes de ver otra ronda (o las conjeturas generales del torneo).
fr: Veuillez vous assurer de sauvegarder vos suppositions à chaque fois avant de visionner un autre tour (ou les suppositions globales du tournoi).
it: Assicurati di salvare le tue ipotesi ogni volta prima di visualizzare un altro round (o le ipotesi complessive del torneo).
nl: Zorg ervoor dat u uw gissingen elke keer opslaat voordat u een andere ronde bekijkt (of de algemene gissingen van het toernooi).

source: Overall Tournament Guesses will lock at 6 pm of the day of the first match. Match guesses will lock one hour before scheduled start of the match.
de: Turnier-Tipps müssen vor 18 Uhr am Tag des ersten Spiels abgegeben werden. Tipps für ein Spiel sind möglich bis eine Stunde vor geplantem Match Start.
es: Las predicciones generales del torneo se cerrarán a las 18:00 horas del día del primer partido. Las predicciones para un partido se cerrarán una hora antes del inicio programado del encuentro.
it: I pronostici generali del torneo saranno bloccati alle 18:00 del giorno della prima partita. I pronostici per una partita si chiuderanno un'ora prima dell'inizio programmato del match.

source: Save my guesses
de: Meine Tipps speichern
es: Guarda mis conjeturas
fr: Garde mes suppositions
it: Salva le mie ipotesi
nl: Bewaar mijn gissingen

source: Register a new player
de: Einen neuen Spieler registrieren
es: Registrar un nuevo jugador
fr: Enregistrer un nouveau joueur
it: Registra un nuovo giocatore
nl: Registreer een nieuwe speler
